Repository: matlo/GIMX
Catalog: po/*.po
Languages: tr

source: ignoring: -%c %s (max controllers reached)
tr: Yok Sayılıyor: -%c %s (Maks. Kontroller Sayısına Ulaşıldı)

source: option %s
tr: %s Seçeneği

source: with arg %s
tr: %s arg ile

source: controller #%d: option -b with value `%s'
tr: Kontroller #%d: -b Baglanilan Port `%s'

source: now reading arguments for controller #%d
tr: Simdi #%d Kontroller icin Bagimsiz Degiskenleri Okuyor

source: global option -c with value `%s'
tr: Ayarli Config Degeri -c `%s'

source: Bad event format: %s
tr: Kötü Etkinlik Biçimi: %s

source: controller #%d: option -e with value `%s(%d)'
tr: Kontroller #%d: -e Baglanilan Port `%s(%d)'

source: Bad axis name for event: %s
tr: Etkinlik İçin Hatalı Eksen Adı: %s

source: controller #%d: option -h with value `%d'
tr: Kontroller #%d: -h Baglanilan Port `%d'

source: Bad format for argument -d: '%s'
tr: Argüman İçin Kötü Format -d: '%s'

source: controller #%d: option -d with value `%s'
tr: Kontroller #%d: -d Baglanilan Port `%s'

source: Bad format for argument -s: '%s'
tr: Argüman İçin Kötü Format -s: '%s'

source: controller #%d: option -s with value `%s'
tr: Kontroller #%d: -s Baglanilan Port `%s'

source: controller #%d: option -k with value `%s'
tr: Kontroller #%d: -k Baglanilan Port `%s'

source: can't open log file (%s)
tr: Log Dosyası Açılamıyor (%s)

source: global option -l with value `%s'
tr: Ayarli Config Degeri -l `%s'

source: log file can't be used with curses
tr: Log Dosyası Fare Modunda Kullanılamaz

source: only one log file can be specified
tr: Sadece Bir Log Dosyası Belirtilebilir

source: port already used: `%s'
tr: Port Zaten Kullanılmış: `%s'

source: controller #%d: option -p with value `%s'
tr: Kontroller #%d: -p Baglanilan Port `%s'

source: global option -q with value `%s'
tr: Ayarli Config Degeri -q `%s'

source: global option -r with value `%s'
tr: Ayarli Config Degeri -r `%s'

source: controller #%d: option -t with value `%s'
tr: Kontroller #%d: -t Baglanilan Port `%s'

source: unrecognized option: %c
tr: Tanımlanamayan Seçenek: %c

source: grab flag is unset
tr: Pencere Yakalama Ayarlandi

source: status flag is set
tr: Durum Ayarlandi

source: subpos flag is set
tr: subpos Ayarlandi

source: force_updates flag is set
tr: Guncellemeleri Zorlama Ayarlandi

source: curses flag is set
tr: Fare Modu Ayarlandi

source: window_events flag is set
tr: Pencere Olayları Ayarlandi

source: btstack flag is set
tr: Bluetooth Ayarlandi

source: skip_leds flag is set
tr: Ledleri Gec Ayarlandi

source: ff_conv flag is set
tr: ff_conv Ayarlandi

source: auto-grab flag is set
tr: Otomatik Pencere Yakalama Ayarlandi

source: %s flag is set
tr: %s Durum Ayarlandi

source: calibrating mouse %s (%d)
tr: %s Fare Kalibrasyonu (%d)

source: calibrating conf %d
tr: Conf Kalbirasyonu %d

source: sensibility:
tr: Duyarlılık:

source: x/y ratio:
tr: x/y Oranı:

source: dead zone x:
tr: Ölü Bölge X:

source: dead zone y:
tr: Ölü Bölge Y:

source: shape:
tr: Şekil:

source: Circle
tr: Daire

source: Rectangle
tr: Dikdörtgen

source: acceleration x:
tr: Hızlanma X:

source: acceleration y:
tr: Hızlanma Y:

source: radius: %d
tr: Yarıçap: %d

source: velocity: %d
tr: Hız: %d

source: time: %d
tr: Zaman: %d

source: mouse selection
tr: Fare Seçimi

source: profile selection
tr: Profil Seçimi

source: error writting the config file %s
tr: Config Dosyası %s Yazılırken Hata Oluştu

source: calibration done
tr: Kalibrasyon Tamam

source: calibrating sensitivity
tr: Kalibrasyon Duyarlılığı

source: calibrating x/y ratio
tr: x/y Oran Kalibrasyonu

source: calibrating dead zone x
tr: Ölü Bölge Kalibrasyonu X

source: calibrating dead zone y
tr: Ölü Bölge Kalibrasyonu Y

source: calibrating dead zone shape
tr: Ölü Bölge Kalibrasyonu Şekil

source: calibrating acceleration x
tr: Hızlanma Kalibrasyonu X

source: calibrating acceleration y
tr: Hızlanma Kalibrasyonu Y

source: adjusting circle test radius
tr: Daire Testi Yarıçapı Ayarlama

source: adjusting circle test velocity
tr: Daire Testi Hızını Ayarlama

source: translation test started
tr: Çeviri Testi Başladı

source: controller %d profile %d axis %s intensity: %.0f
tr: Kontroller %d Profil %d Eksen %s Şiddeti : %.0f

source: %d %ld.%06ld controller %d is switched from profile %d to %d
tr: %d %ld.%06ld Kontroller %d, %d ile %d Profilden Değiştirildi

source: joystick not found: %s %d
tr: Joystick Bulunamadı: %s %d

source: mouse not found: %s %d
tr: Fare Bulunamadı: %s %d

source: keyboard not found: %s %d
tr: Klavye Bulunamadı: %s %d

source: A device name is empty. Multiple mice and keyboards are not managed.
tr: Bir Cihaz Adi Bos. Birden Cok Fare ve Klavye Yonetilmez.

source: connected to %s:%d
tr: %s ya bağlı : %d

source: no pass-through device is needed
tr: Geçiş Cihazına Gerek Yoktur

source: found pass-through device 0x%04x:0x%04x
tr: Gecis Cihazı Bulundu 0x%04x:0x%04x

source: macros are not available for: %s %s (%d)
tr: Makrolar İçin Mevcut Değil: %s %s (%d)

source: no GPP detected.
tr: GPP Tespit Edilmedi.

source: GPP detected, controller type is: %s.
tr: GPP Tespit Edildi, Kontrolor Tipi: %s.

source: unknown GPP controller type.
tr: Bilinmeyen GPP Kontroller Tipi.

source: failed to open the GIMX adapter
tr: GIMX Adaptör Açılamadı

source: GIMX adapter detected, controller type is: %s.
tr: GIMX Adaptor Algilandi, Kontroller Tipi: %s.

source: wrong controller type.
tr: Yanlış Kontrollor Tipi

source: failed to get the GIMX adapter status.
tr: GIMX Adaptör Durum Bilgisi Alınamadı

source: failed to reset the GIMX adapter.
tr: GIMX Adaptör Sıfırlanamadı

source: Reset sent to the GIMX adapter.
tr: Sifirlama Islemi GIMX Adaptore Gonderildi

source: Disable force updates to work-around #335.
tr: Çalışmalara Güç (work-around) Güncellemelerini Devre Dışı Bırak #335.

source: No game controller was found on USB ports.
tr: USB Bağlantı Noktalarında Oyun Denetleyicisi Bulunamadı.

source: Start the game with a dualshock 3, and then reassign game controllers.
tr: Oyuna Bir Dualshock 3 (DS3) ile Başlayın ve Oyun Denetleyicilerini Yeniden Atayabilirsiniz.

source: failed to connect to network destination: %s:%d.
tr: Ağ Hedefine Bağlanamadı: %s:%d.

source: Remote GIMX detected, controller type is: %s.
tr: Uzaktan GIMX Algılandı, Denetleyici Tipi:%s.

source: failed to start the GIMX adapter.
tr: GIMX Bağdaştırıcısı Başlatılamadı.

source: failed to start the GIMX adapter asynchronous processing.
tr: GIMX Bağdaştırıcısı Eş Zamanlı İşlem Başlatılamadı.

source: Press the %s button to activate the controller.
tr: Kontroller Etkinlestirmek Icin ( %s ) Dugmesine Basin.

source: failed to initialize the sixaxis emulation.
tr: Sixaxis Emülasyonu Başlatılamadı.

source: failed to initialize the dualshock 4 emulation.
tr: Dualshock 4 (DS4) Emülasyonu Başlatılamadı.

source: unsupported bluetooth controller type.
tr: Desteklenmeyen Bluetooth Denetleyici Türü.

source: failed to start the GPP asynchronous processing.
tr: GPP Eşzamansız İşlem Başlatılamadı.

source: failed to listen on network source: %s:%d.
tr: Ağ Kaynağından Dinlenemedi: %s:%d.

source: Press Shift+Esc to exit.
tr: Çıkmak İçin Shift+ESC Tuşlarına Basın.

source: Mouse calibration (Ctrl+F1 to edit)
tr: Fare Kalibrasyonu (Düzenlemek İçin Ctrl+F1)

source: Mouse calibration (Ctrl+F1 to save)(mouse wheel to change values)
tr: Fare Kalibrasyonu (Kaydetmek İçin Ctrl+F1) Basın. (Değerleri Değiştirmek İçin Fare Tekerleriğini Oynatın)

source: Profile:
tr: Profil:

source: Dead zone:
tr: Ölü Bölge:

source: shape=
tr: Şekil=

source: circle
tr: Daire

source: rectangle
tr: Dikdörtgen

source: Acceleration:
tr: Hızlanma:

source: test (F6)
tr: Test Et (F6)

source: Sensitivity:
tr: Duyarlılık:

source: circle test
tr: Daire Testi

source: radius=%d (F10)
tr: Yarı Çap=%d (F10)

source: velocity=%d (F11)
tr: Hız=%d (F11)

source: ratio=
tr: Oran=

source: Left stick
tr: Sol Çubuk

source: Right stick
tr: Sağ Çubuk

source: Buttons
tr: Düğmeler

source: Refresh rate:
tr: Yenileme Oranı:

source: Refresh rate: %4dHz
tr: Yenileme Oranı: %4dHz

source: using default refresh period: %.02fms
tr: Varsayilan Yenileme Suresini Kullanma: %.02fms

source: Unknown key name for argument --keygen: '%s'
tr: Bağımsız Değişken İçin Bilinmeyen Anahtar Adı --keygen: '%s'

source: Exiting
tr: Çıkılıyor

source: Increase
tr: Artış

source: Decrease
tr: Azalma

source: Circle
tr: Daire

source: Rectangle
tr: Dikdörtgen

source: mouse
tr: Fare

source: keyboard
tr: Klavye

source: axis
tr: Eksen

source: axis up
tr: Eksen Yukarı

source: axis down
tr: Eksen Aşağı

source: button
tr: Düğme

source: Aiming
tr: Hedefleyen

source: Driving
tr: Sürüş

source: Tip
tr: İpucu

source: Click here to go to online documentation.
tr: Çevrimiçi Belgelere Gitmek İçin Buraya Tıklayın.

source: Gimx-config
tr: Gimx-Config (Çeviri - Osman Çitçi)

source: Device
tr: Cihaz

source: Button
tr: Düğme

source: Auto detect
tr: Otomatik Algılama

source: Switch back
tr: Geri Dön

source: Delay (ms):
tr: Gecikme (ms):

source: Delete
tr: Sil

source: Mouse
tr: Fare

source: Mode
tr: Mod

source: Smoothing
tr: Düzleştirme

source: Buffer size [1..30]
tr: Arabellek Boyutu [1..30]

source: Filter [0.00..1.00]
tr: Filtre [0.00..1.00]

source: Buffer size
tr: Tampon Boyutu

source: Filter
tr: Filtre

source: Add
tr: Ekle

source: Remove
tr: Kaldır

source: Modify
tr: Değiştir

source: Axis
tr: Eksen

source: Direction
tr: Yön

source: DZ
tr: Ölü Bölge

source: Dead zone
tr: Ölü Bölge

source: Shape
tr: Şekil

source: Steps
tr: Adımlar

source: Broken-line correction parameters
tr: Bozuk Satır Düzeltme Parametreleri

source: Low value [-32767..32767]
tr: Düşük Değer [-32767..32767]

source: Low coef
tr: Düşük Katsayı

source: High value [-32767..32767]
tr: Yüksek Değer [-32767..32767]

source: High coef
tr: Yüksek Katsayı

source: Low value
tr: Düşük Değer

source: High value
tr: Yüksek Değer

source: Invert direction
tr: Ters Yön

source: Constant
tr: Sabit

source: Profile trigger
tr: Profil Tetikleme

source: Mouse options
tr: Fare Seçenekleri

source: Axis intensity
tr: Eksen Yoğunluğu

source: Joystick corrections
tr: Joystick Düzeltmeleri

source: Force Feedback Tweaks
tr: Force Feedback Düzenlemeleri

source: Event
tr: Etkinlik

source: Threshold
tr: Eksen Değeri

source: Label
tr: Etiket

source: Sens.
tr: Duyarlılık

source: Sensitivity
tr: Duyarlılık

source: Accel.
tr: Hızlanma

source: Acceleration
tr: Hızlanma

source: Dead zone [-64..64]
tr: Ölü Bölge [-64..64]

source: Sensitivity [-100.00..100.00]
tr: Duyarlılık [-100.00..100.00]

source: Acceleration [0.00..]
tr: Hızlanma [0.00..]

source: Overall
tr: Genel

source: New Ctrl-N
tr: Yeni Ctrl+N

source: Create a new configuration
tr: Yeni Bir Yapılandırma Oluştur

source: Open a configuration file
tr: Bir Yapılandırma Dosyası Aç

source: Save Ctrl-S
tr: Kaydet Ctrl-S

source: Save configuration
tr: Yapılandırmayı Kaydet

source: Save As...
tr: Farklı Kaydet...

source: Save configuration to specified file
tr: Yapılandırmayı Belirtilen Dosyaya Kaydet

source: Open config directory
tr: Config Dizinizi Aç

source: Quit Alt-F4
tr: Çıkış Alt-F4

source: Quit the application
tr: Uygulamadan Çık

source: &File
tr: &Dosya

source: Copy Profile
tr: Profili Kopyala

source: Copy Controller
tr: Kontroller Kopyala

source: Paste Profile
tr: Profili Yapıştır

source: Paste Controller
tr: Kontroller Yapıştır

source: Set Mouse DPI
tr: Fare DPI Ayarla

source: Replace Mouse
tr: Fareyi Değiştir

source: Convert mouse sensitivity
tr: Fare Duyarlılığını Dönüştür

source: Replace Keyboard
tr: Klavyeyi Değiştir

source: Edit
tr: Düzenle

source: Controller
tr: Kontroller

source: Type
tr: Tür

source: Profile
tr: Profil

source: Multiple Mice and Keyboards
tr: Çoklu Fare ve Klavye

source: Window events
tr: Pencere Olayları

source: Link controls
tr: Bağlantı Kontrolleri

source: Auto-bind controls
tr: Otomatik-Bağlama Kontrolü

source: Advanced
tr: Gelişmiş

source: About F1
tr: Hakkında F1

source: Show info about this application
tr: Bu Uygulama Hakkında Bilgi Göster

source: Help
tr: Yardım

source: Select file
tr: Dosya Seçin

source: XML files (*.xml)|*.xml
tr: XML Dosyaları (*.xml) | *.xml

source: It's not recommended to run as root user. Continue?
tr: Bu Kök Kullanıcı Olarak Çalıştırmak İçin Tavsiye Edilmez. Devam Edilsin Mi?

source: Confirm
tr: Onayla

source: Can't migrate directory:
tr: Dizin Taşınamıyor:

source: Error
tr: Hata

source: Can't init directory:
tr: Başlatma Dizini Olamaz:

source: Info
tr: Bilgi

source: Cannot open config file:
tr: Config Dosyası Açılamıyor:

source: Please detect an Event!
tr: Lütfen Bir Etkinlik Tespit Edin!

source: Please select a Button!
tr: Lütfen Bir Düğme Seçin!

source: Please select an Axis!
tr: Lütfen Bir Eksen Seçin!

source: Press a button.
tr: Bir Tuşa Bas.

source: Move an axis.
tr: Bir Ekseni Hareket Ettir.

source: Pedal calibration: 1. fully press the pedal 2. fully release the pedal 3. press any key or button
tr: Pedal Kalibrasyon: 1. Tam Olarak Pedala Basın 2. Pedalı Tamamen Serbest Bırakın 3. Her Hangi Bir Tuşa Veya Düğmeye Basın

source: Failed to calibrate the pedal.
tr: Pedal Kalibre Edilemedi.

source: Joystick correction has been added in the "Overall>Joystick corrections" panel
tr: Joystick Düzeltmeleri "Tüm>Joystick Düzeltmeleri" Paneline Eklendi

source: Can't save
tr: Kaydedemiyorum

source: Save config file
tr: Config Dosyasını Kaydet

source: Please select a line of the table.
tr: Lütfen Tablonun Bir Satırını Seçin.

source: Please select a SINGLE line of the table.
tr: Lütfen Tablonun TEK Satırını Seçiniz.

source: Apply
tr: Uygula

source: Press a mouse button.
tr: Bir Fare Düğmesine Basın.

source: Press a keyboard key.
tr: Bir Klavye Tuşuna Basın.

source: This will replace the mouse in the current controller. Continue?
tr: Bu Mevcut Denetleyicideki Fareyi Değiştirir. Devam et?

source: This will replace the keyboard in the current controller. Continue?
tr: Bu Mevcut Kontroller Klavyenin Yerini Alacak. Devam Et?

source: Enter a number:
tr: Bir Numara Girin:

source: Source mouse DPI
tr: Fare DPI Ayarlar

source: Destination mouse DPI
tr: Hedef Fare DPI

source: Failed to parse sensitivity value!
tr: Duyarlılık Değeri Ayrıştırılamadı!

source: Failed to parse acceleration value!
tr: Hızlandırma Değeri Ayrıştırılamadı!

source: Mouse DPI value
tr: Fare DPI Değeri

source: This control is already used in the current profile (Button tab). Continue?
tr: Bu Kontrol Halihazırdaki Profilde Kullanılmaktadır (Düğme Sekmesi). Devam Et?

source: This control is already used in the current profile (Axis tab). Continue?
tr: Bu Kontrol Geçerli Profilde Kullanılmaktadır (Eksen Sekmesi). Devam Et?

source: This control is already used in the current profile (Overall tab>Intensity tab). Continue?
tr: Bu Kontrol Geçerli Profilde Kullanılmaktadır (Genel sekmesi> Eksen Yoğunluğu Sekmesi). Devam Et?

source: No config opened!
tr: Hiçbir Config Açılmamış!

source: Select the reference config.
tr: Referans Config Seçin.

source: Can't auto-bind controls!
tr: Denetimleri Otomatik Bağlayamıyorum!

source: Done!
tr: Bitti!

source: Please detect a button!
tr: Lütfen Bir Düğme Tespit Edin!

source: Please select an axis!
tr: Lütfen Bir Eksen Seçin!

source: Please detect a mouse!
tr: Lütfen Bir Fare Tespit Edin!

source: Mouse options already defined!
tr: Fare Seçenekleri Zaten Tanımlanmış!

source: Please detect a joystick axis!
tr: Lütfen Bir Joystick Eksenini Tespit Edin!

source: Joystick axis options already defined!
tr: Joystick Eksen Seçenekleri Zaten Tanımlanmış!

source: Select an event.
tr: Bir Etkinlik Seçin.

source: Events
tr: Etkinlikler

source: No joystick found!
tr: Joystick Bulunamadı!

source: Use the calibration tool to adjust the parameters.
tr: Parametreleri Ayarlamak İçin Kalibrasyon Aracını Kullanın.

source: OK
tr: TAMAM

source: Cancel
tr: İptal

source: Gimx-fpsconfig
tr: Gimx-Fpsconfig (Çeviri - Osman Çitçi)

source: Buffer size (Hip Fire)
tr: Tampon Boyutu (Hip Fire)

source: Buffer size (ADS)
tr: Tampon Boyutu (ADS)

source: Dead zone (Hip Fire)
tr: Ölü Bölge (Hip Fire)

source: Dead zone (ADS)
tr: Ölü Bölge (ADS)

source: Sensitivity (ADS)
tr: Duyarlılık (ADS)

source: Sensitivity (Hip Fire)
tr: Duyarlılık (Hip Fire)

source: Acceleration (ADS)
tr: Hızlanma (ADS)

source: Filter (Hip Fire)
tr: Filtre (Hip Fire)

source: Filter (ADS)
tr: Filtre (ADS)

source: Acceleration (Hip Fire)
tr: Hızlanma (Hip Fire)

source: Dead zone shape
tr: Ölü Bölge Şekli

source: Aiming Down the Sights
tr: Görülecek Yerler

source: x/y ratio
tr: x/y Oranı

source: Dead zone shape (Hip Fire)
tr: Ölü Bölge Şekli (Hip Fire)

source: Dead zone shape (ADS)
tr: Ölü Bölge Şekli (ADS)

source: x/y ratio (Hip Fire)
tr: x/y Oranı (Hip Fire)

source: x/y ratio (ADS)
tr: x/y Oranı (ADS)

source: Enter your mouse DPI value.
tr: Fare DPI Değerini Girin.

source: Mouse DPI
tr: Fare DPI

source: Mouse smoothing
tr: Fare Yumuşatma

source: Convert sensitivity
tr: Duyarlılık Dönüştür

source: New Ctrl+N
tr: Yeni Ctrl+N

source: Open Ctrl+O
tr: Aç Ctrl+O

source: Save Ctrl+S
tr: Kaydet Ctrl+S

source: Save As
tr: Farklı Kaydet

source: Edit Labels
tr: Etiketleri Düzenle

source: Edit Label
tr: Etiketi Düzenle

source: Joystick controls are only supported through gimx-config.
tr: Joystick Kontrolleri Sadece Gimx-Config ile Desteklenir.

source: Profiles 1 & 2 do not contain the same bindings. Editing this conf with gimx-fpsconfig can mess the bindings.
tr: 1 & 2 ci Profiller Aynı Bağlantıları İçermez. Bu Config Gimx-Fpsconfig İle Düzenlemek Bağlantıları Bozabilir.

source: Auto-bind done!
tr: Otomatik-Bağlama Tamam!

source: Select the event.
tr: Etkinliği Seçin.

source: Connecting
tr: Bağlanıyor

source: Progress:
tr: İlerleme:

source: Waiting for installation to complete
tr: Güncelleme Uygun Yüklemeyi Başlat

source: A device requires the following component:
tr: Bir Cihaz Aşağıdaki Bileşeni Gerektirir:

source: Download and install?
tr: İndir ve Yükle?

source: Downloading
tr: İndiriliyor

source: Can't retrieve Logitech Gaming Software!
tr: Logitech Oyun Yazılımı Alınamıyor!

source: Address already used!
tr: Adres Zaten Kullanılmış!

source: Did you saved your dongle address?
tr: Dongle Adresini Kaydettin Mi?

source: Please save it!
tr: Lütfen Kaydet!

source: Success
tr: Başarılı

source: Read address after set: ko!
tr: Ayarlandıktan Sonra Adresi Oku: Tamam!

source: Read address after set: seems ok!
tr: Ayarlandıktan Sonra Adresi Oku: İyi Görünüyor!

source: Cannot open directory:
tr: Dizin Açılamıyor:

source: Cannot open file:
tr: Dosya Açılamıyor:

source: Cannot open file for writing:
tr: Yazmak İçin Dosya Açılamıyor:

source: Gimx-launcher
tr: Gimx Türkiye (Çeviri - Osman Çitçi)

source: Output
tr: Çıkış

source: New
tr: Yeni

source: Input
tr: Giriş

source: Physical devices
tr: Fiziksel Aygıtlar

source: Network
tr: Ağ

source: Messages
tr: Mesajlar

source: none
tr: Yok

source: curses
tr: Fare Modu

source: text
tr: Metin

source: log file
tr: Log Dosyası

source: debug
tr: Hata Ayıkla

source: Mouse capture
tr: Fare Yakalama

source: auto
tr: Otomatik

source: on
tr: Açık

source: off
tr: Kapalı

source: Check
tr: Kontrol

source: Start
tr: Çalıştır

source: Edit config
tr: Config Düzenle

source: Edit fps config
tr: FPS Config Düzenle

source: Open macro directory
tr: Makro Dizinini Aç

source: Auto-bind and convert
tr: Otomatik-Bağlama Ayarla ve Dönüştür

source: Refresh F5
tr: Yenile F5

source: Get configs
tr: Oyun Config İndir

source: Update
tr: Program Güncelle

source: Update firmware
tr: Adaptör Güncelle

source: Check updates at startup
tr: Başlangıçta Güncellemeleri Kontrol Et

source: Can't migrate config:
tr: Config Yapılandırılamıyor:

source: GIMX adapter
tr: GIMX Adaptör

source: Remote GIMX
tr: GIMX Yönet

source: No config found! Download configs?
tr: Config Bulunamadı! Configleri İndir?

source: Failed to read debug flags!
tr: Hata Ayıklama Okunamadı!

source: No debug flag found!
tr: Hata Ayıklama Bulunamadı!

source: Select the debug flags:
tr: Hata Ayıklamaları Seçin:

source: No config selected!
tr: Config Seçilmedi!

source: No device selected!
tr: Cihaz Seçilmedi!

source: No USB to serial device selected!
tr: USB Cihazı Seçilmedi!

source: No destination IP:port specified!
tr: Hedef IP:PORT Yok!

source: No pairing selected!
tr: Eşleşme Seçilmedi!

source: Selected pairing is incorrect!
tr: Seçilen Eşleşme Yanlış!

source: Dongle not found!
tr: Dongle Bulunamadı!

source: No source IP:port specified!
tr: Kaynak IP:PORT Yok!

source: IP:port is the same for input and output!
tr: IP:PORT Giriş ve Çıkış İçin Aynıdır!

source: Bluetooth service has to be stopped. Proceed?
tr: Bluetooth Servisinin Durdurulması Gerekiyor. Devam Etmek İstermisin?

source: Can't stop bluetoothd!
tr: Bluetooth Durdurulamıyor!

source: Windows Task Manager has to be stopped. Proceed?
tr: Windows Görev Yöneticisi durdurulmalıdır. İlerle?

source: Select the destination:
tr: Hedefi Seçin:

source: can't start gimx!
tr: Gimx Başlatılamaz!

source: GIMX failed with a generic error (please report this).
tr: GIMX Genel Bir Hata ile Başarısız Oldu ( Lütfen Bunu Bildirin ).

source: Failed to detect the GPP/Cronus/Titan device.
tr: GPP/Cronus/Titan Cihazını Tespit Edilemedi.

source: Failed to detect the USB adapter: . make sure to select the right port . make sure to power on the target console If you built the adapter yourself: . make sure the wiring is correct (swapping RX and TX is a common mistake) . make sure it runs the right firmware
tr: USB Bağdaştırıcısı Algılanmadı: . Doğru Bağlantı Noktasını Seçtiğinizden Emin Olun . Hedef Konsolu Açtığınızdan Emin Olun Eğer Adaptörü Kendiniz Yaptıysanız: . Kablolamanın Doğru Olduğundan Emin Olun (RX ve TX'nin Değiştirilmesi Yaygın Bir Hatadır) . Doğru Yazılım Yüklediğinizden Emin Olun

source: Failed to detect the remote GIMX instance: . make sure to fill the right IP:port . make sure the remote instance is running
tr: GIMX Yönetme Algılanmadı: . Doğru IP:PORT Girdiğinizden Emin Olun . Uzaktan Yönetimin Çalıştığından Emin Olun

source: Failed to detect the adapter (fallback error message).
tr: Bağdaştırıcı Algılanamadı (Geri Dönüş Hata Mesajı).

source: GIMX exited and the activation button was not pressed.
tr: Etkinleştirme Tuşuna Basılmadığı İçin GIMX'ten Çıkış Yapıldı.

source: Inactivity timeout.
tr: Hareketsizlik Zaman Aşımı.

source: No wired Xbox 360 controller was found on USB ports.
tr: USB Bağlantı Noktalarında Xbox 360 (XBC) Bulunamadı.

source: No Dualshock 4 controller was found on USB ports.
tr: USB Bağlantı Noktalarında Dualshock 4 (DS4) Bulunamadı.

source: No Xbox One controller was found on USB ports.
tr: USB Bağlantı Noktalarında Xbox One Kontroller Bulundu.

source: There was a connection error with the official controller: . make sure the cable wasn't pulled . make sure the cable is not bad (try another one) . make sure to turn controller off before connection.
tr: Kontroller ile Bir Bağlantı Hatası Oluştu: . Kablonun Çekilmediğinden Emin Olun . Kablonun Deforme Olmadığından Emin Olun (Başka Bir Kablo Deneyin) . Bağlantıdan Önce Kontrolleri Kapattığınızdan Emin Olun.

source: Mouse was captured, input was "physical devices", and focus was lost. Either you pressed alt+tab or some other app took focus.
tr: Fare Yakalandı, Giriş "Fiziksel Aygıtlar ", idi ve odak kaybedildi. Alt+Tab Tuşlarına Bastınız yada Başka Bir Uygulama Pencereyi Kaybettirdi Lütfen Kontrol Ediniz.

source: Failed to open log file. GIMX may have crashed (please report this).
tr: Log Dosyası Açılamadı. GIMX Çöktü (Lütfen Bunu Rapor Edin).

source: GIMX ran less than 5 seconds. Would you like to generate a log report?
tr: GIMX 5 Saniyeden Daha Az Çalıştı. Bir Log Dosyası Oluşturmak İster Misiniz?

source: This config seems OK!
tr: Ayarlar İyi Görününüyor.. TAMAM!

source: Failed to start gimx-config!
tr: Gimx-Config Başlatılamadı!
