Repository: matlo/GIMX
Catalog: po/*.po
Languages: tr

source: Failed to start gimx-fpsconfig!
tr: Gimx-Fpsconfig Başlatılamadı!

source: No Serial Port Detected!
tr: Seri Bağlantı (PORT) Noktası Algılanmadı!

source: No device detected!
tr: Cihaz Algılanmadı!!

source: Pairing
tr: Eşleştiriyor

source: No pairing found. Perform a new pairing?
tr: Eşleşme Bulunamadı. Yeni Bir Eşleşme Yapılsın Mı?

source: New/Repair
tr: Yeni/Onarım

source: Installing
tr: Kuruluyor

source: Update available. Start installation?
tr: Güncelleme Uygun. Yüklemeyi başlat?

source: Downloading update
tr: Güncelleme İndiriliyor

source: Can't retrieve update file!
tr: Güncelleme Dosyası Alınamıyor!

source: Can't check version!
tr: Sürüm Kontrol Edilemiyor! İnternet Bağlantınızı Kontrol Edin!

source: GIMX is up-to-date!
tr: GIMX Güncel Durumda!

source: Downloading config list
tr: Config Dosyaları İndiriliyor

source: Select the files to download.
tr: İndirilecek Dosyaları Seçin.

source: Config download
tr: Config İndir

source: Overwrite local file:
tr: Yerel Dosyanın Üstüne Yaz:

source: Downloading
tr: İndiriliyor

source: Completed
tr: Tamamlandı

source: Can't retrieve configs!
tr: Config Dosyası Alınamıyor!

source: Can't retrieve config list!
tr: Config Listesi Alınamıyor!

source: Can't read config:
tr: Config Okunamıyor:

source: Can't auto-bind controls for config:
tr: Config İçin Otomatik-Bağlama Yapılamaz:

source: Can't write config:
tr: Config Yazılamıyor:

source: Auto bind done for
tr: Referans Config Ayarlandı :

source: Controller:
tr: Kontroller:

source: Console:
tr: Konsol:

source: Select the pairing.
tr: Eşleştirmeyi Seçin.

source: PS Tool
tr: PS Aracı

source: Device:
tr: Cihaz:

source: Address:
tr: Adres:

source: Manufacturer:
tr: Üretici Firma:

source: Chip:
tr: Çip:

source: Select the bluetooth adapter.
tr: Bluetooth Adaptörünü Seçin.

source: Plug a sixaxis/ds3
tr: Bir Sixaxis / DS3 Takın

source: Plug a bluetooth dongle
tr: Bir Bluetooth Dongle Takın

source: Plug a ds4
tr: DS4 Takın

source: Cannot execute:
tr: Yürütemedi:

source: Plug the teensy
tr: Teensy'yi Takın

source: Plug the Teensy to the PS4, wait a few seconds, and plug it back to the PC
tr: Teensy'yi PS4'e Takın, Birkaç Saniye Bekleyin, ve Tekrar PC'ye Takın

source: Select the pairing to restore.
tr: Geri Yüklemek İçin Eşleştirmeyi Seçin.

source: No previous pairing found!
tr: Önceki Eşleşme Bulunamadı!

source: Success.
tr: Başarılı.

source: Plug a ds4 to repair.
tr: Düzeltmek İçin Bir DS4 Takın.

source: Enter an IP address
tr: Bir IP Adresi Girin

source: Enter a port
tr: Bir PORT Girin

source: Bad IP format!
tr: Kötü IP formatı!

source: Repair
tr: Onarım

source: Failed to execute gimx-loader.
tr: Gimx-Loader Çalıştırılamadı.

source: Gimx-loader
tr: Gimx-Loader (Çeviri - Osman Çitçi)

source: Load
tr: Yükle

source: About
tr: Hakkında

source: No firmware found in
tr: Firmware Bulunamadı

source: This tool is only compatible with GIMX adapters made with a USB to UART adapter and a Pro Micro board. Proceed?
tr: Yazılım Güncelleme Sadece GIMX Adaptör için Geçerlidir. Devam Etmek İstermisin ?

source: Plug both sides of the adapter to the computer.
tr: GIMX Adaptörün Her İki Girişini Bilgisayara Bağlayın yada GIMX Adaptör Üstündeki Reset Tuşuna Basınız..

source: Unplug/replug the USB cable from/to computer USB port.
tr: USB Kablosunu Bilgisayar USB Portuna Tekrar Takın yada Reset Tuşuna Basın..

source: No new device found within 10 seconds.
tr: GIMX Adaptör Algılanmadı.

source: failed to load firmware
tr: Ürün Yazılımı Yüklenemedi

source: Failed to load firmware.
tr: Firmware Yüklenemedi.

source: Firmware loaded successfully!
tr: Yazılım Başarıyla Yüklendi!

source: file
tr: Dosya

source: specifies a file to open
tr: Açılacak Bir Dosya Seçin

source: Do you want to save your configuration?
tr: Yapılandırmanızı Kaydetmek İstermisiniz?

source: Physical devices (elevated privileges)
tr: Fiziksel Aygıtlar ( Yüksek Öncelik )

source: Export to clipboard
tr: Panoya Aktar

source: Import from clipboard
tr: Panodan İçe Aktar
